tests/TestLoad/ArchivosJMeter/Resultados-Rampa1/carpeta_reporte_web/statistics.json
{
  "AsignarDronPlan" : {
    "transaction" : "AsignarDronPlan",
    "sampleCount" : 225,
    "errorCount" : 119,
    "errorPct" : 52.88889,
    "meanResTime" : 165367.49777777772,
    "medianResTime" : 286276.0,
    "minResTime" : 6.0,
    "maxResTime" : 341997.0,
    "pct1ResTime" : 331238.0,
    "pct2ResTime" : 336866.7,
    "pct3ResTime" : 341367.04,
    "throughput" : 0.5699607866978751,
    "receivedKBytesPerSec" : 0.9044416806623704,
    "sentKBytesPerSec" : 0.05872773036548418
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 225,
    "errorCount" : 119,
    "errorPct" : 52.88889,
    "meanResTime" : 165367.49777777772,
    "medianResTime" : 286276.0,
    "minResTime" : 6.0,
    "maxResTime" : 341997.0,
    "pct1ResTime" : 331238.0,
    "pct2ResTime" : 336866.7,
    "pct3ResTime" : 341367.04,
    "throughput" : 0.5699607866978751,
    "receivedKBytesPerSec" : 0.9044416806623704,
    "sentKBytesPerSec" : 0.05872773036548418
  }
}