tests/TestLoad/ArchivosJMeter/Resultados-Rampa2/carpeta_reporte_web/statistics.json
{
  "AsignarDronPlan" : {
    "transaction" : "AsignarDronPlan",
    "sampleCount" : 125,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 13.351999999999995,
    "medianResTime" : 9.0,
    "minResTime" : 5.0,
    "maxResTime" : 388.0,
    "pct1ResTime" : 15.0,
    "pct2ResTime" : 16.69999999999999,
    "pct3ResTime" : 300.1199999999983,
    "throughput" : 0.5041237321288137,
    "receivedKBytesPerSec" : 0.4953330745498175,
    "sentKBytesPerSec" : 0.1104109742695247
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 125,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 13.351999999999995,
    "medianResTime" : 9.0,
    "minResTime" : 5.0,
    "maxResTime" : 388.0,
    "pct1ResTime" : 15.0,
    "pct2ResTime" : 16.69999999999999,
    "pct3ResTime" : 300.1199999999983,
    "throughput" : 0.5041237321288137,
    "receivedKBytesPerSec" : 0.4953330745498175,
    "sentKBytesPerSec" : 0.1104109742695247
  }
}